import 'package:flutter/material.dart';
import 'package:flutter_final_project/presentation/styles/text_styles.dart';

class UserAgreementWidget extends StatefulWidget {
  const UserAgreementWidget({super.key});

  @override
  State<UserAgreementWidget> createState() => _UserAgreementWidgetState();
}

class _UserAgreementWidgetState extends State<UserAgreementWidget> {
  final PageController _controller = PageController();
  int _currentPage = 0;
  int page = 1;
  bool _isVisible = false;

  @override
  void initState() {
    super.initState();
    Future.delayed(Duration.zero, () {
      setState(() {
        _isVisible = true;
      });
    });
  }

  void _closeWidget() {
    setState(() {
      _isVisible = false;
    });
    Future.delayed(const Duration(milliseconds: 300), () {
      if (mounted) {
        Navigator.pop(context);
      }
    });
  }

  @override
  void dispose() {
    _controller.dispose();
    super.dispose();
  }

  @override
  Widget build(BuildContext context) {
    return LayoutBuilder(
      builder: (context, constraints) {
        final width = constraints.maxWidth * 0.95;
        final height = constraints.maxHeight * 0.95;
        return Center(
          child: AnimatedOpacity(
            opacity: _isVisible ? 1.0 : 0.0,
            duration: const Duration(milliseconds: 300),
            child: Container(
              width: width,
              height: height,
              decoration: BoxDecoration(
                color: Colors.white,
                borderRadius: BorderRadius.circular(20),
                boxShadow: [
                  BoxShadow(
                    color: Colors.black.withAlpha(50),
                    blurRadius: 10,
                  ),
                ],
              ),
              child: Column(
                children: [
                  Padding(
                    padding: const EdgeInsets.all(16.0),
                    child: Column(
                      children: [
                        Row(
                          mainAxisAlignment: MainAxisAlignment.spaceBetween,
                          children: [
                            IconButton(
                              icon: const Icon(
                                Icons.arrow_back,
                                color: Colors.grey,
                              ),
                              iconSize: 32,
                              onPressed: _closeWidget,
                            ),
                            IconButton(
                              icon: const Icon(
                                Icons.close,
                                color: Colors.grey,
                              ),
                              iconSize: 32,
                              onPressed: () {
                                Navigator.pop(context);
                              },
                            ),
                          ],
                        ),
                      ],
                    ),
                  ),
                  Expanded(
                    child: PageView(
                      scrollDirection: Axis.horizontal,
                      controller: _controller,
                      onPageChanged: (index) {
                        setState(() {
                          _currentPage = index;
                        });
                      },
                      children: <Widget>[
                        Container(
                          color: Colors.white60,
                          child: Center(
                            child: Padding(
                              padding: const EdgeInsets.all(10.0),
                              child: SingleChildScrollView(
                                child: RichText(
                                  text: TextSpan(
                                    children: [
                                      TextSpan(
                                        text: 'Угода користувача\n ',
                                        style: TextStyles.oderAppBarText,
                                      ),
                                      TextSpan(
                                        text:
                                            '''Текст цього документу є договором, публічною пропозицією ФОП Козловський Дмитро Володимирович (надалі “Продавець”, "Ми") укласти на вашу користь (надалі “Ви”, "Покупець") договір на умовах, що викладені нижче.
                                  Будь ласка, уважно ознайомтесь з положеннями цієї угоди, перш ніж використовувати наш мобільний додаток (надалі – додаток), адже з моменту прийняття її умов, ця пропозиція виступає юридично обов’язковим договором між нами (надалі разом — «Сторони»).
                                  maisternia-mlintsiv2.ps.me — Веб-сайт, тобто набір веб-сторінок, який доступний в Інтернеті під одним доменом за адресою https://maisternia-mlintsiv2.ps.me (надалі “Сайт”, “веб-сайт”). Цей набір включає в себе різні ресурси, такі як Контент, об'єкти інтелектуальної власності, іншу інформацію та матеріали. Метою веб-сайту є централізація інформації про товари та послуги Продавця та продаж товарів Покупцю дистанційним способом.
                                  ''',
                                        style: TextStyles.spanBodyText,
                                      ),
                                      WidgetSpan(
                                        child: Padding(
                                          padding: EdgeInsets.symmetric(
                                              vertical: 8.0,),
                                          child: Text(
                                            'Предмет та порядок укладення Договору',
                                            style: TextStyles.oderAppBarText,
                                            textAlign: TextAlign.start,
                                          ),
                                        ),
                                      ),
                                      TextSpan(
                                        text:
                                            '''Предметом цієї угоди є забезпечення Покупцеві можливості отримувати послуги, які доступні на веб-сайті, отримувати доступ до вмісту, розміщеного на веб-сайті, а також придбавати товари: готові страви, фрукти та овочі, хлібобулочні вироби, алкогольні та безалкогольні напої, молочні продукти, м'ясні та ковбасні вироби, кондитерські вироби, тютюнові вироби та предмети, пов’язані з їх вживанням (далі Товари) із каталогу веб-сайту для будь-яких цілей.
                                  Покупець виражає згоду на умови цього Договору та укладає цей Договір шляхом реєстрації на Сайті, додатковим підтвердженням згоди на умови цього договору є здійснення оплати.
                                  Підтверджуючи свою згоду з умовами цього Договору, покупець таким чином підтверджує, що ці умови не порушують його законних прав та інтересів.
                                  Якщо ви не погоджуєтеся з цією Угодою, ви зобов'язані припинити використання Сайту і всіх його сторінок і покинути Сайт.\n''',
                                        style: TextStyles.spanBodyText,
                                      ),
                                      TextSpan(
                                        text: 'Реєстрація на Сайті\n',
                                        style: TextStyles.oderAppBarText,
                                      ),
                                      TextSpan(
                                        text:
                                        '''Для оформлення замовлення на сайті необхідно зареєструватися. Реєстрація відбувається через форму на сайті або за телефоном за допомогою оператора. Після реєстрації
                                         Покупцем , створюється обліковий запис. Реєстрація є прийняттям цієї угоди в повному обсязі.''',
                                        style: TextStyles.spanBodyText,
                                      ),
                                    ],
                                  ),
                                  textAlign: TextAlign.justify,
                                ),
                              ),
                            ),
                          ),
                        ),
                        Container(
                          color: Colors.white60,
                          child: Center(
                            child: Padding(
                              padding: const EdgeInsets.all(10.0),
                              child: SingleChildScrollView(
                                child: RichText(
                                  text: TextSpan(
                                    children: [
                                      TextSpan(
                                        text:
                                            '''Під час реєстрації Покупець повинен надавати достовірну, точну і вичерпну інформацію про себе. Якщо Покупець надає невірну інформацію або Продавець має підстави вважати, що надана інформація неповна або недостовірна, продавець має право відмовити Покупцю у наданні послуг та продажі Товарів за цим договором.
                                  Покупець несе повну відповідальність за надання невірних або неповних відомостей при реєстрації. Надаючи неправдиву або неповну інформацію, Покупець самостійно несе ризик неможливості виконання Продавцем своїх зобовʼязань за цим Договором.
                                  Під час реєстрації на сайті Покупець передає Продавцю таку контактну інформацію: ім'я та прізвище, адресу електронної пошти та контактний телефон. Ця інформація використовується Продавцем для ідентифікації Покупця та виконання ним своїх зобовʼязань за цим Договором . Така інформація також може використовуватися Продавцем в інших законних цілях, із додержанням вимог законодавства у сфері обробки даних та Політики конфіденційності.
                                  Інформація надана Покупцем, що перебуває у Продавця (була йому передана), зберігається та обробляється Продавцем відповідно до Політики конфіденційності та вимог законодавства у сфері обробки даних. Політика конфіденційності є невід'ємною частиною цієї угоди і наведена на сайті.
                                  Покупець має утримуватися від передачі своїх персональних даних, що використовуються для надання послуг або придбання Товарів за цим Договором, третім особам. У разі передачі персональних даних третім особам, Покупець приймає на себе ризик настання несприятливих наслідків (у тому числі втрати персональних даних та/або доступу до Сайту). Продавець не несе відповідальності за дії третіх осіб, які скористалися персональними даними Покупця.
                                  ''',
                                        style: TextStyles.spanBodyText,
                                      ),
                                      WidgetSpan(
                                        child: Padding(
                                          padding: EdgeInsets.symmetric(
                                              vertical: 8.0,),
                                          child: Text(
                                            'Умови продажу Товару та надання послуг\n',
                                            style: TextStyles.oderAppBarText,
                                            textAlign: TextAlign.start,
                                          ),
                                        ),
                                      ),
                                      TextSpan(
                                        text:
                                            '''Використовуючи цей Сайт, ви погоджуєтеся з умовами продажу Товарів та послуг, встановленими Продавцем. Ці умови є публічною офертою.
                                        Будь-які фотографії що розміщені на Сайті є лише ілюстраціями і можуть не відображати фактичний зовнішній вигляд товару.
                                        Будь-яка інформація що позиціонується як така що повʼязані із конкретним товаром або послугою (характеристики, особливості застереження тощо) не є вичерпною і може містити помилки або неточності. Для уточнення інформації щодо товару зверніться до Продавця.
                                        \n''',
                                        style: TextStyles.spanBodyText,
                                      ),
                                    ],
                                  ),
                                  textAlign: TextAlign.justify,
                                ),
                              ),
                            ),
                          ),
                        ),
                        Container(
                          color: Colors.white60,
                          child: Center(
                            child: Padding(
                              padding: const EdgeInsets.all(10.0),
                              child: SingleChildScrollView(
                                child: RichText(
                                  text: TextSpan(
                                    children: [
                                      TextSpan(
                                        text:
                                            '''Замовлення Товарів та послуг Покупцем здійснюється із переліку запропонованого Продавцем. Продавець вживає всіх можливих заходів для забезпечення наявності всіх товарів, представлених на сайті.
                              У разі відсутності товару на момент замовлення Продавець має право виключити його з замовлення або анулювати замовлення, повідомивши про це Покупця. У такому разі вартість анульованого (виключеного) товару
                              повертається покупцю у формі, яка узгоджується Сторонами.\n''',
                                        style: TextStyles.spanBodyText,
                                      ),
                                      TextSpan(
                                        text: 'Доставка Товару\n ',
                                        style: TextStyles.oderAppBarText,
                                      ),
                                      TextSpan(
                                        text:
                                            '''Доставка товарів здійснюється за допомогою способів, які вказані на сайті. Вартість доставки залежить від способу доставки та відстані до місця доставки. Доставка є окремою послугою, та не є невід'ємною частиною придбаного товару.
                          Територія доставки товарів, представлених на сайті, обмежена вимогами до часу доставки задля забезпечення товарного вигляду та безпечності швидкопсувних товарів, однак у будь-якому разі не більше території України.
                          \n''',
                                        style: TextStyles.spanBodyText,
                                      ),
                                      TextSpan(
                                        text: 'Ціна Товару\n ',
                                        style: TextStyles.oderAppBarText,
                                      ),
                                      TextSpan(
                                        text:
                                            '''Ціна товару вказується Продавцем на сайті. Продавець має право в односторонньому порядку змінювати ціну Товару, але ціна на товар, який вже замовлено Покупцем, не підлягає зміні.
                                        На деякі Товари може бути встановлена знижка про що Продавцем окремо вказується на сайті.
                                          Покупець може оплатити товар одним із способів, зазначених на сайті.
                                      Всі розрахунки за цим Договором між Сторонами здійснюється в гривнях (UAH).
                                  \n ''',
                                        style: TextStyles.spanBodyText,
                                      ),
                                      TextSpan(
                                        text: 'Умови повернення\n ',
                                        style: TextStyles.oderAppBarText,
                                      ),
                                      TextSpan(
                                        text:
                                            '''Повернення товару належної якості здійснюється відповідно до Закону України «Про захист прав споживачів», протягом 14 днів з моменту його покупки 
                                        якщо такі товари не були в експлуатації та мають збережений товарний вигляд, а також документ, який підтверджує покупку.
                                        Зауважте, деякі товари не підлягають поверненню, перелік яких затверджений постановою Кабінету Міністрів України від 19 березня 1994 року №172.
                                        Повернення вартості неоплаченого Товару здійснюється Продавцем на банківську картку, поштовим переказом або в готівковій формі.
                                        Спосіб повернення коштів погоджується Сторонами.\n ''',
                                        style: TextStyles.spanBodyText,
                                      ),
                                    ],
                                  ),
                                  textAlign: TextAlign.justify,
                                ),
                              ),
                            ),
                          ),
                        ),
                        Container(
                          color: Colors.white60,
                          child: Center(
                            child: Padding(
                              padding: const EdgeInsets.all(10.0),
                              child: SingleChildScrollView(
                                child: RichText(
                                  text: TextSpan(
                                    children: [
                                      TextSpan(
                                        text: 'Відповідальність\n ',
                                        style: TextStyles.oderAppBarText,
                                      ),
                                      TextSpan(
                                        text:
                                            '''Сторони несуть відповідальність за невиконання або неналежне виконання умов цього договору в порядку, передбаченому цим договором та чинним законодавством України.
                      Продавець не несе відповідальності за:
                      •	Неналежне виконання своїх зобов'язань за цим договором у разі надання Покупцем недостовірної, неправдивої чи неповної інформації.
                      •	Невідповідності зовнішнього вигляду товару у порівнянні із зображенням на сайті.
                      •	Використання товару Покупцем, якщо таке використання здійснене всупереч інформації про товар.
                      •	Наслідки використання товару Покупцем, якщо покупець має медичні обмеження та/або індивідуальну чутливість до інгредієнтів певного товару.
                      У максимальній мірі, яка тільки допускається законодавством, Продавець не несе відповідальність за будь-які збитки та/або шкоду (включаючи збитки що повʼязані з втратою комерційної вигоди,
                       перериванням комерційної або виробничої діяльності, втратою даних чи прибутку), що можуть виникнути в результаті використання Сайту або неможливості використовувати Сайт, а також в результаті
                       використання Сайту незалежно від результатів такого використання.
                      Сторони звільняються від відповідальності за повне або часткове невиконання своїх зобов'язань у випадку, якщо таке невиконання сталося через непереборні обставини (форс-мажор), такі як війна
                       або воєнні дії, землетрус, повінь, пожежа та інші стихійні природні події, а також дії органів державної влади, зміни в митних правилах, обмеження в імпорті та експорті, які виникли поза 
                       волею Сторін після укладання цього Договору. Сторона, яка не може виконати свої зобов'язання, негайно повідомляє про це іншу Сторону і надає необхідні відомості, які підтверджують існування 
                       таких обставин, видані відповідними уповноваженими органами.\n''',
                                        style: TextStyles.spanBodyText,
                                      ),
                                      TextSpan(
                                        text: 'Заборонена поведінка\n ',
                                        style: TextStyles.oderAppBarText,
                                      ),
                                      TextSpan(
                                        text: '''Покупцю заборонено:
                      •	Обходити, вимикати чи іншим чином втручатися в будь-які пов’язані з безпекою функції Сайту або функції, які запобігають чи обмежують використання чи копіювання вмісту, доступного через Сайт.
                      •	Надавати неправдиву інформацію або іншим способом вводити в оману Продавця.
                      •	Надсилати повідомлення небажаного змісту, спам або повторювати повідомлення декілька разів.
                      •	Брати участь у незаконних або протиправних діяннях.
                      •	Змінювати, втручатися, перехоплювати, порушувати або намагатися іншим способом завадити роботі Сайту, так само вживати будь-яких інших дій, які можуть зашкодити Сайту.
                      •	Порушувати будь-які права інших Покупців.
                      Сайт Продавця містить матеріали, захищені авторським правом, включаючи, але не обмежуючись, тексти, фотографії, графічні зображення, музичні та звукові твори.
                      Покупець чи будь-які інші треті особи не мають права без згоди Продавця використовувати матеріали, розміщені на сайті, у будь-яких цілях, включаючи, але не обмежуючись, копіювання, публікацію, передачу третім особам тощо.\n ''',
                                        style: TextStyles.spanBodyText,
                                      ),
                                    ],
                                  ),
                                  textAlign: TextAlign.justify,
                                ),
                              ),
                            ),
                          ),
                        ),
                        Container(
                          color: Colors.white60,
                          child: Padding(
                            padding: const EdgeInsets.all(10.0),
                            child: SingleChildScrollView(
                              child: RichText(
                                text: TextSpan(
                                  children: [
                                    TextSpan(
                                      text: 'Інші положення\n ',
                                      style: TextStyles.oderAppBarText,
                                    ),
                                    TextSpan(
                                      text:
                                          '''Продавець залишає за собою право обмежувати доступ до Сайту частково або повністю з метою проведення профілактичних або інших технічних робіт, або з будь-яких інших технічних причин. Продавець також може періодично проводити необхідні профілактичні роботи без попереднього повідомлення Покупців.
                          Продавець має право односторонньо змінювати умови цього Договору, а також ціни на Товари та послуги, а також інші відомості, розміщені на Сайті.
                          У випадку виникнення питань або претензій з боку Покупця, він може звернутися до Продавця за контактами, наведеними на Сайті.
                          Спроба вирішити всі суперечки шляхом переговорів є першочерговим заходом. У разі неможливості досягнення згоди, суперечка може бути передана на розгляд суду відповідно до чинного законодавства. Спір між Сторонами буде розглядатися за правом України в українському суді.
                          Визнання будь-якого положення цього Договору судом як недійсного не впливає на чинність інших положень цього Договору.
                          Використовуючи наш Сайт, Ви підтверджуєте, що розумієте ці умови та погоджується з ними.
                          Якщо ви не погоджуєтеся з умовами цього договору, ви не можете використовувати Сайт.\n''',
                                      style: TextStyles.spanBodyText,
                                    ),
                                  ],
                                ),
                                textAlign: TextAlign.justify,
                              ),
                            ),
                          ),
                        ),
                      ],
                    ),
                  ),
                  Row(
                    mainAxisAlignment: MainAxisAlignment.spaceBetween,
                    children: [
                      ElevatedButton(
                        onPressed: _previousPage,
                        child: const Text('Previous Page'),
                      ),
                      Text(
                        '${page + _currentPage}',
                        style: TextStyles.cartBottomText,
                      ),
                      ElevatedButton(
                        onPressed: _nextPage,
                        child: const Text('Next Page'),
                      ),
                    ],
                  ),
                ],
              ),
            ),
          ),
        );
      },
    );
  }

  void _nextPage() {
    if (_currentPage < 6) {
      _controller.animateToPage(
        _currentPage + 1,
        duration: const Duration(milliseconds: 300),
        curve: Curves.easeInOut,
      );
    }
  }

  void _previousPage() {
    if (_currentPage > 0) {
      _controller.animateToPage(
        _currentPage - 1,
        duration: const Duration(milliseconds: 300),
        curve: Curves.easeInOut,
      );
    }
  }
}
